Series

In [74]:
import pandas as pd
data = pd.Series(['서울', '부산', '대전'])
print(data)

0    서울
1    부산
2    대전
dtype: object

In [75]:
import numpy as np
data = pd.Series(np.array([1,2,3]))
print(data)

0    1
1    2
2    3
dtype: int32

In [76]:
data = pd.Series((1,2,3))
print(data)

0    1
1    2
2    3
dtype: int64

In [77]:
data = pd.Series({'서울':1, '부산':2})
print(data)

서울    1
부산    2
dtype: int64

데이터 타입 설명

In [78]:
data = pd.Series(np.array([1,2,3,4,5]))
print(data)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [79]:
data = pd.Series(np.array([1,2,3,4,5]))
data.info()

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      int32
dtypes: int32(1)
memory usage: 152.0 bytes

In [80]:
data = pd.Series([1,2,3])
print("index:", data.index)
print("value:", data.values)

index: RangeIndex(start=0, stop=3, step=1)
value: [1 2 3]

In [81]:
data1 = pd.Series([1,2,3])
print(data1.dtypes)

data2 = pd.Series([0.1,0.2,0.3])
print(data2.dtypes)

int64
float64

In [82]:
data = pd.Series([10,20,30])
print("<<기존 데이터>>")
print(data)

data.index = ["서울", "부산", "대전"]
print("<<index 변경후>>")
print(data)

<<기존 데이터>>
0    10
1    20
2    30
dtype: int64
<<index 변경후>>
서울    10
부산    20
대전    30
dtype: int64

In [83]:
data = pd.Series([10,20,30])
data.index = ["서울", "부산", "대전"]
print("index 조회:", data['서울'])
print("index 조회:", data.at['부산'])

index 조회: 10
index 조회: 20

series 연산

In [84]:
data = pd.Series([10,20,30])
data += 10
print(data)

0    20
1    30
2    40
dtype: int64

In [85]:
data = pd.Series([10,20,30])
data -= 20
print(data)

0   -10
1     0
2    10
dtype: int64

In [86]:
data = pd.Series([10,20,30])
data *= 2
print(data)

0    20
1    40
2    60
dtype: int64

In [87]:
data = pd.Series([10,20,30])
data /= 2
print(data)

0     5.0
1    10.0
2    15.0
dtype: float64

In [88]:
data1 = pd.Series([1,2,3])
data2 = pd.Series([5,20,60])
print(data1+data2)

0     6
1    22
2    63
dtype: int64

In [89]:
data1 = pd.Series([1,2,3])
data2 = pd.Series([5,20,60])
print(data1-data2)

0    -4
1   -18
2   -57
dtype: int64

In [90]:
data1 = pd.Series([1,2,3])
data2 = pd.Series([5,20,60])
print(data1*data2)

0      5
1     40
2    180
dtype: int64

In [91]:
data1 = pd.Series([1,2,3])
data2 = pd.Series([5,20,60])
print(data1/data2)

0    0.20
1    0.10
2    0.05
dtype: float64

Series 결측치 처리

In [92]:
data1 = pd.Series([1,2,3], index=['강남','노원','서초'])
data2 = pd.Series([4,5,6], index=['강남','마포','동작'])
total = data1+data2
print(total)

강남    5.0
노원    NaN
동작    NaN
마포    NaN
서초    NaN
dtype: float64

In [93]:
result1 = total.fillna(0)
print(result1)

강남    5.0
노원    0.0
동작    0.0
마포    0.0
서초    0.0
dtype: float64

In [94]:
result2 = total.dropna()
print(result2)

강남    5.0
dtype: float64

Series 통계

In [95]:
data = pd.Series([10,20,30,40,50])
data.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

In [96]:
print("평균:", data.mean())
print("분산:", data.var())
print("표준편차:", data.std())
print("최솟값:", data.min())
print("1/4분위수:", data.quantile(0.25))
print("2/4분위수:", data.quantile(0.5))
print("3/4분위수:", data.quantile(0.75))
print("최댓값:", data.max())

평균: 30.0
분산: 250.0
표준편차: 15.811388300841896
최솟값: 10
1/4분위수: 20.0
2/4분위수: 30.0
3/4분위수: 40.0
최댓값: 50

DataFrame

In [97]:
df = pd.DataFrame([[1,2,3], [4,5,6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [98]:
df = pd.DataFrame({"강남구":[1,2,3], 
                   "영등포구":[4,5,6],
                   "서초구":[7,8,9]})
df

   강남구  영등포구  서초구
0    1     4    7
1    2     5    8
2    3     6    9

index, column 설정

In [99]:
df = pd.DataFrame([[1,2], [3,4]],
                  index=['A', 'B'],
                  columns=['서울','부산'])
df

   서울  부산
A   1   2
B   3   4

In [100]:
df = pd.DataFrame([[1,2], [3,4]],
                  index=['A', 'B'],
                  columns=['서울','부산'])
df.index = ['1주', '2주']
df.columns = ['서울시', '부산시']
df

    서울시  부산시
1주    1    2
2주    3    4

조회하기

In [101]:
df = pd.DataFrame([[1,2], [3,4]],
                  index=['A', 'B'],
                  columns=['서울','부산'])
print(df['서울'])
print(df.서울)
print(df[['서울','부산']])

A    1
B    3
Name: 서울, dtype: int64
A    1
B    3
Name: 서울, dtype: int64
   서울  부산
A   1   2
B   3   4

In [102]:
df = pd.DataFrame({'서울':[1,2],'부산시':[3,4],'대전시':[5,6]})
df

   서울  부산시  대전시
0   1    3    5
1   2    4    6

In [103]:
df.rename(columns={'서울':'서울시'})

   서울시  부산시  대전시
0    1    3    5
1    2    4    6

In [104]:
df = pd.DataFrame({'서울':[1,2],'부산':[3,4],'대전':[5,6]})
df.drop(columns=['서울','대전'])

   부산
0   3
1   4

In [105]:
df = pd.DataFrame([10,20,30],index=['A','B','C'])
df

    0
A  10
B  20
C  30

In [106]:
df.reset_index()

  index   0
0     A  10
1     B  20
2     C  30

In [107]:
df.reset_index(drop=True)

    0
0  10
1  20
2  30

인덱스로 조회하기

In [108]:
df = pd.DataFrame([[1,2],[3,4],[5,6]])
df.index = ['A','B','C']
df.columns = ['서울','부산']
df

   서울  부산
A   1   2
B   3   4
C   5   6

In [109]:
df.loc[['A','B']]

   서울  부산
A   1   2
B   3   4

In [110]:
df.iloc[0]

서울    1
부산    2
Name: A, dtype: int64

In [111]:
df.iloc[1]

서울    3
부산    4
Name: B, dtype: int64

In [112]:
df.iloc[1:]

   서울  부산
B   3   4
C   5   6

인덱스와 컬럼 동시사용으로 조회

In [113]:
df = pd.DataFrame([[1,2],[3,4],[5,6]])
df.index = ['A','B','C']
df.columns = ['서울','부산']
df

   서울  부산
A   1   2
B   3   4
C   5   6

In [114]:
df.loc['A','서울']

1

In [115]:
df.loc['B','부산']

4

In [116]:
df.loc['A'][:]

서울    1
부산    2
Name: A, dtype: int64

In [117]:
df.loc['A'][['서울','부산']]

서울    1
부산    2
Name: A, dtype: int64

In [118]:
df.iloc[0,0]

1

In [119]:
df.iloc[1,1:]

부산    4
Name: B, dtype: int64

In [120]:
df.iloc[:,:]

   서울  부산
A   1   2
B   3   4
C   5   6

In [121]:
df.iloc[1:, :1]

   서울
B   3
C   5

In [122]:
df.iloc[1:, [0,1]]

   서울  부산
B   3   4
C   5   6

조건으로 열의 값 추출

In [123]:
df = pd.DataFrame({"서울":[10,20,30],
                   "부산":[4,5,6],
                   "대전":[7,8,9]})
df

   서울  부산  대전
0  10   4   7
1  20   5   8
2  30   6   9

In [124]:
df[df['서울']>10]

   서울  부산  대전
1  20   5   8
2  30   6   9

In [125]:
df[df['서울']==10]

   서울  부산  대전
0  10   4   7

In [126]:
df[df['서울']!=20]

   서울  부산  대전
0  10   4   7
2  30   6   9

조건으로 찾기 예시

In [127]:
data = {
    'Game': ['Game A', 'Game B', 'Game C', 'Game D'],
    'Genre': ['Action', 'Adventure', 'Action', 'RPG'],
    'Mar_Sales': [1.5, 0.8, 1.2, 0.6],  # 3월 판매량 (백만 단위)
    'Apr_Sales': [1.0, 0.5, 0.8, 0.3]   # 4월 판매량 (백만 단위)
}

df = pd.DataFrame(data)

# 장르가 'RPG'이며, 3월 판매량이 0.5백만 이상인 게임
filtered_df = df[(df['Genre'] == 'RPG') & (df['Mar_Sales'] > 0.5)]

# 결과 출력
print(filtered_df[['Game', 'Mar_Sales', 'Apr_Sales']])

     Game  Mar_Sales  Apr_Sales
3  Game D        0.6        0.3

데이터 샘플링

In [128]:
df = pd.DataFrame({"서울":[10,20,30,40,50,60],
                   "부산":[5,10,15,20,25,30],
                   "대구":[7,14,21,28,35,42]})
df

   서울  부산  대구
0  10   5   7
1  20  10  14
2  30  15  21
3  40  20  28
4  50  25  35
5  60  30  42

In [129]:
df.sample(frac=0.5)

   서울  부산  대구
1  20  10  14
3  40  20  28
4  50  25  35

In [130]:
df.sample(n=4)

   서울  부산  대구
3  40  20  28
0  10   5   7
2  30  15  21
4  50  25  35

데이터 프레임 합치기

In [131]:
data1 = pd.DataFrame({
    '지역명':['강남','서초','노원'],
    '번호':[1,2,3],
    '매출':[100,200,300]})
data1

  지역명  번호   매출
0  강남   1  100
1  서초   2  200
2  노원   3  300

In [132]:
data2 = pd.DataFrame({
    '지역명':['강남','도봉','노원'],
    '번호':[10,40,30],
    '매출':[10,20,30]})
data2

  지역명  번호  매출
0  강남  10  10
1  도봉  40  20
2  노원  30  30

In [133]:
pd.merge(
    left=data1, 
    right=data2, 
    how='inner', 
    on='지역명'
)

  지역명  번호_x  매출_x  번호_y  매출_y
0  강남     1   100    10    10
1  노원     3   300    30    30

In [134]:
pd.merge(
    left=data1, 
    right=data2, 
    how='left', 
    on='지역명'
)

  지역명  번호_x  매출_x  번호_y  매출_y
0  강남     1   100  10.0  10.0
1  서초     2   200   NaN   NaN
2  노원     3   300  30.0  30.0

In [135]:
pd.merge(
    left=data1, 
    right=data2, 
    how='right', 
    on='지역명'
)

  지역명  번호_x   매출_x  번호_y  매출_y
0  강남   1.0  100.0    10    10
1  도봉   NaN    NaN    40    20
2  노원   3.0  300.0    30    30

In [136]:
pd.merge(
    left=data1, 
    right=data2, 
    how='outer', 
    on='지역명'
)

  지역명  번호_x   매출_x  번호_y  매출_y
0  강남   1.0  100.0  10.0  10.0
1  노원   3.0  300.0  30.0  30.0
2  도봉   NaN    NaN  40.0  20.0
3  서초   2.0  200.0   NaN   NaN

인덱스 기준으로 합치기

In [137]:
data1 = pd.DataFrame({
    '지역명':['강남','서초','노원'],
    '번호':[1,2,3],
    '매출':[100,200,300]})
data1.index = ['1월','2월','3월']
data1

   지역명  번호   매출
1월  강남   1  100
2월  서초   2  200
3월  노원   3  300

In [138]:
data2 = pd.DataFrame({
    '지역명':['강남','도봉','노원'],
    '번호':[10,40,30],
    '매출':[10,20,30]})
data2.index = ['1월','2월','3월']
data2

   지역명  번호  매출
1월  강남  10  10
2월  도봉  40  20
3월  노원  30  30

In [139]:
pd.merge(left=data1,
         right=data2,
         left_index=True,
         right_index=True,
         how='inner'
)

   지역명_x  번호_x  매출_x 지역명_y  번호_y  매출_y
1월    강남     1   100    강남    10    10
2월    서초     2   200    도봉    40    20
3월    노원     3   300    노원    30    30

데이터 프레임 연산

In [140]:
data1 = pd.DataFrame({
    '지역명':['강남','서초','노원'],
    '번호':[1,2,3],
    '매출':[100,200,300]})
data1.index = ['1월','2월','3월']
data1

   지역명  번호   매출
1월  강남   1  100
2월  서초   2  200
3월  노원   3  300

In [141]:
data2 = pd.DataFrame({
    '지역명':['강남','서초','노원'],
    '번호':[10,40,30],
    '매출':[10,20,30]})
data2.index = ['1월','2월','3월']
data2

   지역명  번호  매출
1월  강남  10  10
2월  서초  40  20
3월  노원  30  30

In [142]:
data1[['번호','매출']]+data2[['번호','매출']]

    번호   매출
1월  11  110
2월  42  220
3월  33  330

In [143]:
data1[['번호','매출']]-data2[['번호','매출']]

    번호   매출
1월  -9   90
2월 -38  180
3월 -27  270

In [144]:
data1[['번호','매출']]*data2[['번호','매출']]

    번호    매출
1월  10  1000
2월  80  4000
3월  90  9000

In [145]:
data1[['번호','매출']]/data2[['번호','매출']]

      번호    매출
1월  0.10  10.0
2월  0.05  10.0
3월  0.10  10.0

In [146]:
test = {
    "index":[1,2,9,32,47],
    "이름":["홍길동","김준기","이명식","방준혁","최명기"],
    "나이":[25,21,22,24,31],
    "지역":["서울","서울","부산","광주","부산"]}
df = pd.DataFrame(test)
df.to_excel("cdata.xlsx")

In [147]:
df = pd.read_csv("cdata.csv")
df

   index   이름  나이  지역
0      1  홍길동  25  서울
1      2  김준기  21  서울
2      9  이명식  22  부산
3     32  방준혁  24  광주
4     47  최명기  31  부산

In [148]:
df = pd.read_csv("cdata_nohead.csv")
df

    1  홍길동  25  서울
0   2  김준기  21  서울
1   9  이명식  22  부산
2  32  방준혁  24  광주
3  47  최명기  31  부산

In [149]:
df = pd.read_csv("cdata_nohead.csv", header=None)
df

    0    1   2   3
0   1  홍길동  25  서울
1   2  김준기  21  서울
2   9  이명식  22  부산
3  32  방준혁  24  광주
4  47  최명기  31  부산

In [150]:
df = pd.read_csv("cdata_nohead.csv", 
                 header=None,
                 names=["index", "이름", "나이", "지역"])
df

   index   이름  나이  지역
0      1  홍길동  25  서울
1      2  김준기  21  서울
2      9  이명식  22  부산
3     32  방준혁  24  광주
4     47  최명기  31  부산

In [151]:
df = pd.read_csv("cdata_nohead.csv", header=None)
df.columns = ["index", "이름", "나이", "지역"]
df

   index   이름  나이  지역
0      1  홍길동  25  서울
1      2  김준기  21  서울
2      9  이명식  22  부산
3     32  방준혁  24  광주
4     47  최명기  31  부산

In [152]:
df = pd.read_csv("cdata_nohead.csv", 
                 header=None,
                 names=["index", "이름", "나이", "지역"],
                 index_col="index")
df

        이름  나이  지역
index
1      홍길동  25  서울
2      김준기  21  서울
9      이명식  22  부산
32     방준혁  24  광주
47     최명기  31  부산

엑셀파일 불러오기

In [153]:
df = pd.read_excel("cdata.xlsx")
df

   Unnamed: 0  index   이름  나이  지역
0           0      1  홍길동  25  서울
1           1      2  김준기  21  서울
2           2      9  이명식  22  부산
3           3     32  방준혁  24  광주
4           4     47  최명기  31  부산

In [154]:
import numpy as np

In [155]:
test = {
    "index":[1,2,9,32,47],
    "이름":["홍길동","김준기","이명식","방준혁","최명기"],
    "나이":[25,np.nan,22,np.nan,31],
    "지역":["서울","서울",np.nan,"광주","부산"]}
df = pd.DataFrame(test)
df.to_csv("cdata_nan.csv")

In [156]:
df = pd.read_csv("cdata_nan.csv",
                 index_col="index")
df

       Unnamed: 0   이름    나이   지역
index
1               0  홍길동  25.0   서울
2               1  김준기   NaN   서울
9               2  이명식  22.0  NaN
32              3  방준혁   NaN   광주
47              4  최명기  31.0   부산

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 47
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      int64
 1   이름          5 non-null      object
 2   나이          3 non-null      float64
 3   지역          4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 200.0+ bytes

In [158]:
df.describe()

       Unnamed: 0         나이
count    5.000000   3.000000
mean     2.000000  26.000000
std      1.581139   4.582576
min      0.000000  22.000000
25%      1.000000  23.500000
50%      2.000000  25.000000
75%      3.000000  28.000000
max      4.000000  31.000000

In [159]:
df.isnull()

       Unnamed: 0     이름     나이     지역
index
1           False  False  False  False
2           False  False   True  False
9           False  False  False   True
32          False  False   True  False
47          False  False  False  False

In [160]:
df.dropna()

       Unnamed: 0   이름    나이  지역
index
1               0  홍길동  25.0  서울
47              4  최명기  31.0  부산

In [161]:
df["나이"] = df["나이"].fillna(25)
df

       Unnamed: 0   이름    나이   지역
index
1               0  홍길동  25.0   서울
2               1  김준기  25.0   서울
9               2  이명식  22.0  NaN
32              3  방준혁  25.0   광주
47              4  최명기  31.0   부산

In [162]:
df["지역"] = df["지역"].fillna("서울")
df

       Unnamed: 0   이름    나이  지역
index
1               0  홍길동  25.0  서울
2               1  김준기  25.0  서울
9               2  이명식  22.0  서울
32              3  방준혁  25.0  광주
47              4  최명기  31.0  부산

정렬

In [163]:
df = pd.read_csv("cdata_nohead.csv", 
                 header=None,
                 names=["index", "이름", "나이", "지역"],
                 index_col="index")
df

        이름  나이  지역
index
1      홍길동  25  서울
2      김준기  21  서울
9      이명식  22  부산
32     방준혁  24  광주
47     최명기  31  부산

In [164]:
df.sort_index()

        이름  나이  지역
index
1      홍길동  25  서울
2      김준기  21  서울
9      이명식  22  부산
32     방준혁  24  광주
47     최명기  31  부산

In [165]:
df.sort_index(axis=1)

       나이   이름  지역
index
1      25  홍길동  서울
2      21  김준기  서울
9      22  이명식  부산
32     24  방준혁  광주
47     31  최명기  부산

In [166]:
df.sort_values(by="나이")

        이름  나이  지역
index
2      김준기  21  서울
9      이명식  22  부산
32     방준혁  24  광주
1      홍길동  25  서울
47     최명기  31  부산

In [167]:
df.sort_values(by="나이", ascending=False)

        이름  나이  지역
index
47     최명기  31  부산
1      홍길동  25  서울
32     방준혁  24  광주
9      이명식  22  부산
2      김준기  21  서울